In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
cnx = create_engine('postgresql://USERNAME:PASSWORD@52.0.213.100:5432/lahman')

###1) Show all playerids and salaries with a salary in the year 1985 above 500k.

In [4]:
query = """
SELECT *
FROM salaries
WHERE yearid > 1985 AND salary > 500000;"""
pd.read_sql_query(query, cnx).head()

   yearid teamid lgid   playerid  salary
0    1986    ATL   NL  barkele01  880000
1    1986    ATL   NL  benedbr01  565000
2    1986    ATL   NL   campri01  600000
3    1986    ATL   NL  chambch01  769452
4    1986    ATL   NL  garbege01  786667

###2) Show the team for each year that had a rank of 1.

In [5]:
query = """
SELECT 
    yearid,
    teamid 
FROM teams
WHERE rank = 1;"""
pd.read_sql_query(query, cnx).head()

   yearid teamid
0    1871    PH1
1    1872    BS1
2    1873    BS1
3    1874    BS1
4    1875    BS1

###3) How many schools are in schoolstate of CT?

In [6]:
query = """
SELECT COUNT(*)
FROM schools
WHERE schoolstate = 'CT';
"""
pd.read_sql_query(query, cnx).head()

   count
0     15

###4) How many schools are there in each state?

In [7]:
query = """
SELECT schoolstate, COUNT(*)
FROM schools
GROUP BY schoolstate
ORDER BY schoolstate;
"""
pd.read_sql_query(query, cnx).head()

  schoolstate  count
0          AL     33
1          AR     17
2          AZ     14
3          CA    136
4          CO     11

###5). What was the total spend on salaries by each team, each year?

In [8]:
query = """
SELECT teamid, yearid, AVG(salary)
FROM salaries
GROUP BY teamid, yearid
ORDER BY yearid, teamid;
"""
pd.read_sql_query(query, cnx).head()

  teamid  yearid            avg
0    ATL    1985  673045.454545
1    BAL    1985  525486.909091
2    BOS    1985  435902.400000
3    CAL    1985  515281.928571
4    CHA    1985  468865.619048

###6). Find all of the salaries of shortstops (fieldings, pos) for the year 2012.

In [9]:
query = """
SELECT 
    f.playerid,
    s.salary
FROM fielding f
INNER JOIN salaries s
ON 
    f.playerid = s.playerid AND
    f.yearid = s.yearid
WHERE 
    f.yearid = 2012 AND 
    f.pos = 'SS';"""
pd.read_sql_query(query, cnx).head()

    playerid   salary
0  bloomwi01  1900000
1   drewst01  7750000
2   drewst01  7750000
3  mcdonjo03  1500000
4  pastoty01   480000

###7). What is the first and last year played for each player?

In [10]:
query = """
SELECT 
    playerid, 
    MIN(yearid) AS firstyear,
    MAX(yearid) AS lastyear
FROM allstarfull
GROUP BY playerid
ORDER BY playerid;
"""
pd.read_sql_query(query, cnx).head()

    playerid  firstyear  lastyear
0  aaronha01       1955      1975
1   aasedo01       1986      1986
2  abreubo01       2004      2005
3  abreujo02       2014      2014
4  adamsac01       1943      1943

###8) Who has played the most all star games?

In [11]:
query = """
SELECT *
FROM
    (
    SELECT 
        playerid,
        COUNT(*) AS allstarcount
    FROM allstarfull
    GROUP BY playerid
    ) dummy
ORDER BY allstarcount DESC;
"""
pd.read_sql_query(query, cnx).head()

    playerid  allstarcount
0  aaronha01            25
1  musiast01            24
2   mayswi01            24
3  mantlmi01            20
4  ripkeca01            19

###9) Which school has generated the most distinct players?

In [12]:
query = """
SELECT * 
FROM
    (
    SELECT 
        schoolid,
        COUNT(playerid) playercount
    FROM collegeplaying
    GROUP BY schoolid
    ) dummy
ORDER BY playercount DESC;
"""
pd.read_sql_query(query, cnx).head()

    schoolid  playercount
0      texas          265
1        usc          250
2   stanford          248
3  arizonast          236
4   michigan          191

###10) Which school has generated the most expensive players? (expensive defined by their first year's salary).

In [13]:
query = """
SELECT 
    pro.playerid,
    pro.salary,
    college.schoolid
FROM
    (
    SELECT
        playerid,
        salary,
        RANK() OVER (PARTITION BY playerid ORDER BY yearid) AS yearrk
    FROM salaries
    ) pro
LEFT JOIN 
    (
    SELECT *
    FROM 
        (
        SELECT 
            RANK () OVER (PARTITION BY playerid ORDER BY yearid DESC) yearrk,
            playerid,
            schoolid
        FROM collegeplaying
        ) dummy 
    WHERE yearrk = 1
    ) college
ON pro.playerid = college.playerid
WHERE pro.yearrk = 1
ORDER BY pro.salary DESC;
"""
pd.read_sql_query(query, cnx).head(20)

     playerid    salary    schoolid
0   tanakma01  22000000        None
1   carpech02  14259403      kentst
2    rosajo01  11000000        None
3   cespeyo01   9000000        None
4   kawakke01   8333666        None
5   kurodhi01   7433333        None
6   abreujo02   7000000        None
7   fukudko01   7000000        None
8   matsuda01   6333333        None
9   matsuhi01   6000000        None
10  suzukic01   5666667        None
11  darviyu01   5500000        None
12  contrjo01   5500000        None
13  johjike01   5433333        None
14  matsuka01   5033333        None
15  ueharko01   5000000        None
16  fujikky01   4500000        None
17  strasst01   4375000  sandiegost
18   baezda01   4125000        None
19  jonesja05   4033333  kennesawst

###11) Show the 5 most expensive salaries for each team in the year 2014.

In [14]:
query = """
SELECT
    teamid,
    playerid,
    salary
FROM 
    (
    SELECT
        teamid,
        playerid,
        salary,
        RANK() OVER (PARTITION BY teamid ORDER BY salary DESC) rk
    FROM salaries
    WHERE yearid = 2014
    ) dummy
WHERE rk <= 5;
"""
pd.read_sql_query(query, cnx).head(20)

   teamid   playerid    salary
0     ARI  pradoma01  11000000
1     ARI   hillaa01  11000000
2     ARI  montemi01  10000000
3     ARI  arroybr01   9500000
4     ARI   rossco01   9500000
5     ATL  uptonju01  14250000
6     ATL  santaer01  14100000
7     ATL  uptonbj01  13450000
8     ATL  ugglada01  13000000
9     ATL  kimbrcr01   7000000
10    BAL  markani01  15000000
11    BAL  jonesad01  13000000
12    BAL  jimenub01  11250000
13    BAL  davisch02  10350000
14    BAL   cruzne02   8000000
15    BOS  napolmi01  16000000
16    BOS  ortizda01  15000000
17    BOS  victosh01  13000000
18    BOS  lestejo01  13000000
19    BOS  pedrodu01  12500000

###12) Partition the average salaries by team and year, against year. Find players that were paid more than 1 standard deviation above the average salary for that team and year. Show a count by playerid.

In [15]:
query = """
SELECT
    org.teamid,
    org.yearid,
    org.playerid,
    org.salary,
    std.onestddev
FROM salaries org
INNER JOIN
(
    SELECT
        teamid,
        yearid,
        AVG(salary) + STDDEV(salary) onestddev
    FROM salaries
    GROUP BY teamid, yearid
) std
ON org.teamid = std.teamid AND
org.yearid = std.yearid
WHERE org.salary > std.onestddev;
"""
pd.read_sql_query(query, cnx).head(20)

   teamid  yearid   playerid   salary       onestddev
0     ATL    1985  hornebo01  1500000  1070080.545660
1     ATL    1985  murphda05  1625000  1070080.545660
2     ATL    1985  suttebr01  1354167  1070080.545660
3     BAL    1985   lynnfr01  1090000   844415.186705
4     BAL    1985  murraed02  1472819   844415.186705
5     BOS    1985  armasto01   915000   734409.654817
6     BOS    1985  boggswa01  1000000   734409.654817
7     BOS    1985  bucknbi01   747500   734409.654817
8     BOS    1985  evansdw01   800000   734409.654817
9     BOS    1985   riceji01   779227   734409.654817
10    BOS    1985  stanlbo01  1075000   734409.654817
11    CAL    1985  boonebo01   883000   820561.825704
12    CAL    1985  burleri01   856667   820561.825704
13    CAL    1985  carewro01   875000   820561.825704
14    CAL    1985  decindo01  1100000   820561.825704
15    CAL    1985  jacksre01  1058894   820561.825704
16    CHA    1985   cruzju01  1242333   812961.697469
17    CHA    1985  dotsori01   900000   812961.697469
18    CHA    1985  seaveto01  1136262   812961.697469
19    CHN    1985    ceyro01  1450000   896488.153146

###13) Calculate the win percentage. convert w and g into numerics (floats) to do so. (w::numeric, for example)

In [17]:
query = """
SELECT
    teamid,
    yearid,
    (w)::float / (g)::float AS winper
FROM teams;
"""
pd.read_sql_query(query, cnx).head(20)

   teamid  yearid    winper
0     BS1    1871  0.645161
1     CH1    1871  0.678571
2     CL1    1871  0.344828
3     FW1    1871  0.368421
4     NY2    1871  0.484848
5     PH1    1871  0.750000
6     RC1    1871  0.160000
7     TRO    1871  0.448276
8     WS3    1871  0.468750
9     BL1    1872  0.603448
10    BR1    1872  0.103448
11    BR2    1872  0.243243
12    BS1    1872  0.812500
13    CL1    1872  0.272727
14    MID    1872  0.208333
15    NY2    1872  0.607143
16    PH1    1872  0.638298
17    TRO    1872  0.600000
18    WS3    1872  0.222222
19    WS4    1872  0.000000

###14) rank() the total spend by team each year against their actual rank that year. Is there a correlation of spend to performance?

In [18]:
query = """
SELECT 
    corr(t.rank, s.totalsalary)
FROM teams t
JOIN 
(
    SELECT 
        teamid, 
        yearid,
    SUM(salary) totalsalary
    FROM salaries
    GROUP BY teamid, yearid
) s
ON t.teamid = s.teamid AND t.yearid = s.yearid;
"""
pd.read_sql_query(query, cnx)

       corr
0 -0.270195

Yes as total spending goes up, team get better ranking!